print ('Лабораторная работа №6')
print ('Выполнила студентка групы К19-1 Бодю К. О.')

print ('-------------------------------------------')

print ('Задание 5')

S1 = float(input('Введите S1 '))
S2 = float(input('Введите S2 '))

m = float(input('Введите m '))
n = float(input('Введите n '))

if S1<0 or S2<0 or m<2 or n<2:
    print('Ошибка! Попробуйте заново')
else:
    print('Задание 1')
    _S1 = (S1*m)/100
    _S2 = (S2*n)/100
    print('После 1 года прибыль с S1 ', _S1)
    print('После 1 года прибыль с S2 ', _S2)
    
    print('Задание 2')
    _m = m - 2 
    _n = n - 2 
    _S2 = (S2*m)/100
    S2 = _S2 + S2
    i = 0
    while (i <= 2):
        _S1 = (S1*n)/100
        S1 = _S1 + S1
        i=i+1
    print('После 2 лет прибыль с S1 ', _S1)
    print('После 2 лет прибыль с S2 ', _S2*2)
    
    print('Задание 3')
    i = 0
    while (i <=2):
        _S1 = (S1*n)/100
        S1 = _S1 + S1
        i=i+1
    i = 0
    while (i <=2):
        _S2 = (S2*m)/100
        S2 = _S2 + S2
        i=i+1
    print('После 2 лет прибыль с S1', _S1)
    print('После 2 лет прибыль с S1', _S2)
